[
  {
    "pergunta": "O que é uma estrutura de dados em programação?",
    "respostas": [
      "Uma forma de representar informações de forma organizada e acessível em um programa",
      "Uma função que realiza operações aritméticas em um programa",
      "Uma variável que pode ser acessada em qualquer lugar do programa",
      "Uma forma de representar um loop em um programa"
    ],
    "resposta_correta": "Uma forma de representar informações de forma organizada e acessível em um programa"
  },
  {
    "pergunta": "O que é um array em programação?",
    "respostas": [
      "Uma estrutura de dados que armazena um conjunto de valores do mesmo tipo",
      "Um operador que realiza operações matemáticas",
      "Um tipo de loop que é usado para iterar sobre um conjunto de valores",
      "Uma forma de representar informações de forma organizada e acessível em um programa"
    ],
    "resposta_correta": "Uma estrutura de dados que armazena um conjunto de valores do mesmo tipo"
  },
  {
    "pergunta": "O que é uma recursão em programação?",
    "respostas": [
      "Uma função que executa uma ação repetidamente em um programa",
      "Uma estrutura que define como um conjunto de dados deve ser organizado em um programa",
      "Uma função que se chama a si mesma em um programa",
      "Uma variável que pode ser acessada em qualquer lugar do programa"
    ],
    "resposta_correta": "Uma função que se chama a si mesma em um programa"
  },
  {
    "pergunta": "O que é uma exceção em programação?",
    "respostas": [
      "Um valor fixo que é definido no início do programa",
      "Um valor que pode ser alterado durante a execução do programa",
      "Uma situação que ocorre durante a execução do programa que não pode ser tratada de forma normal",
      "Uma função que retorna um valor"
    ],
    "resposta_correta": "Uma situação que ocorre durante a execução do programa que não pode ser tratada de forma normal"
  },
  {
    "pergunta": "O que é um banco de dados em programação?",
    "respostas": [
      "Um conjunto de regras que definem como um programa deve ser executado",
      "Um conjunto de funções pré-definidas que podem ser usadas em um programa",
      "Uma estrutura de dados que armazena informações em um programa",
      "Uma forma de representar informações de forma organizada e acessível em um programa"
    ],
    "resposta_correta": "Uma estrutura de dados que armazena informações em um programa"
  },
  {
    "pergunta": "O que é HTML?",
    "respostas": [
      "Uma linguagem de marcação usada para criar páginas web",
      "Um programa de edição de texto para desenvolvimento web",
      "Uma linguagem de programação usada para criar sites dinâmicos",
      "Um sistema operacional para servidores web"
    ],
    "resposta_correta": "Uma linguagem de marcação usada para criar páginas web"
  },
  {
    "pergunta": "Qual é o elemento HTML usado para criar uma lista com marcadores?",
    "respostas": [
      "<ul>",
      "<ol>",
      "<li>",
      "<div>"
    ],
    "resposta_correta": "<ul>"
  },
  {
    "pergunta": "O que é um atributo HTML?",
    "respostas": [
      "Um elemento usado para criar um espaço em branco em uma página web",
      "Um valor que é definido para um elemento HTML para alterar seu comportamento ou aparência",
      "Um elemento usado para criar uma quebra de linha em uma página web",
      "Um elemento usado para criar uma imagem em uma página web"
    ],
    "resposta_correta": "Um valor que é definido para um elemento HTML para alterar seu comportamento ou aparência"
  },
  {
    "pergunta": "Qual é o elemento HTML usado para criar uma tabela?",
    "respostas": [
      "<table>",
      "<div>",
      "<ul>",
      "<form>"
    ],
    "resposta_correta": "<table>"
  },
  {
    "pergunta": "O que é uma tag HTML auto-fechada?",
    "respostas": [
      "Uma tag que não tem conteúdo entre suas aberturas e fechamentos",
      "Uma tag que contém apenas um atributo",
      "Uma tag que é fechada automaticamente pelo navegador",
      "Uma tag que é usada para criar um espaço em branco em uma página web"
    ],
    "resposta_correta": "Uma tag que não tem conteúdo entre suas aberturas e fechamentos"
  },
  {
    "pergunta": "Qual é a diferença entre 'display: none;' e 'visibility: hidden;' em CSS?",
    "respostas": [
      "'display: none;' esconde completamente o elemento da página, enquanto 'visibility: hidden;' apenas torna o elemento invisível, mas ainda ocupa espaço na página",
      " display: none;   torna o elemento invisível, mas ainda ocupa espaço na página, enquanto   visibility: hidden;  esconde completamente o elemento da página",
      "Ambas as propriedades têm o mesmo efeito e podem ser usadas de forma intercambiável",
      "Nenhuma das alternativas"
    ],
    "resposta_correta": "'display: none;' esconde completamente o elemento da página, enquanto 'visibility: hidden;' apenas torna o elemento invisível, mas ainda ocupa espaço na página"
  },
  {
    "pergunta": "O que é o modelo de caixa (box model) em CSS?",
    "respostas": [
      "Um modelo matemático usado para calcular o tamanho e posição dos elementos em uma página web",
      "Um modelo que define como as caixas que contêm o conteúdo são renderizadas em uma página web",
      "Um modelo de design gráfico usado para criar elementos visuais em uma página web",
      "Nenhuma das alternativas"
    ],
    "resposta_correta": "Um modelo que define como as caixas que contêm o conteúdo são renderizadas em uma página web"
  },
  {
    "pergunta": "Qual é a propriedade CSS usada para definir o espaçamento entre as bordas de um elemento e seu conteúdo?",
    "respostas": [
      "padding",
      "margin",
      "border",
      "float"
    ],
    "resposta_correta": "padding"
  },
  {
    "pergunta": "Qual é a propriedade CSS usada para definir a posição de um elemento em relação à sua posição normal na página?",
    "respostas": [
      "position",
      "top",
      "left",
      "transform"
    ],
    "resposta_correta": "position"
  },
  {
    "pergunta": "Qual é a diferença entre 'inline' e 'block' em CSS?",
    "respostas": [
      "Elementos com 'inline' são exibidos um após o outro em uma única linha, enquanto elementos com 'block' são exibidos em uma linha separada",
      "Elementos com 'inline' são exibidos em uma linha separada, enquanto elementos com 'block' são exibidos um após o outro em uma única linha",
      "'inline' e 'block' referem-se apenas à posição de um elemento na página e não afetam sua exibição",
      "Nenhuma das alternativas"
    ],
    "resposta_correta": "Elementos com 'inline' são exibidos um após o outro em uma única linha, enquanto elementos com 'block' são exibidos em uma linha separada"
  },
  {
    "pergunta": "Qual é a diferença entre let, const e var em JavaScript?",
    "respostas": [
      "let e const são usados para declarar variáveis ​com escopo de bloco, enquanto var tem escopo global ou de função",
      "var é usado para declarar constantes, enquanto let e const são usados para declarar variáveis",
      "let é usado para declarar constantes, enquanto var e const são usados para declarar variáveis",
      "const é usado para declarar variáveis com escopo de bloco, enquanto var e let têm escopo global ou de função"
    ],
    "resposta_correta": "let e const são usados para declarar variáveis com escopo de bloco, enquanto var tem escopo global ou de função"
  },
  {
    "pergunta": "O que é o método bind em JavaScript?",
    "respostas": [
      "Um método que retorna o valor booleano 'true' se um objeto tem uma determinada propriedade",
      "Um método que cria uma cópia profunda de um objeto",
      "Um método que define o valor de 'this' para uma função, independentemente de como ela é chamada",
      "Um método que retorna uma nova string que contém a cópia de uma parte da string original"
    ],
    "resposta_correta": "Um método que define o valor de 'this' para uma função, independentemente de como ela é chamada"
  },
  {
    "pergunta": "O que é o operador spread em JavaScript?",
    "respostas": [
      "Um operador que permite desestruturar um objeto em várias variáveis",
      "Um operador que permite passar um número variável de argumentos para uma função",
      "Um operador que permite combinar dois ou mais objetos em um único objeto",
      "Nenhuma das alternativas"
    ],
    "resposta_correta": "Um operador que permite passar um número variável de argumentos para uma função"
  },
  {
    "pergunta": "Qual é a diferença entre '==' e '===' em JavaScript?",
    "respostas": [
      "'==' compara valores e tipos de dados, enquanto '===' compara apenas valores",
      "'===' compara valores e tipos de dados, enquanto '==' compara apenas valores",
      "'==' e '===' têm exatamente o mesmo comportamento em JavaScript.",
      "Nenhuma das alternativas"
    ],
    "resposta_correta": "'===' compara valores e tipos de dados, enquanto '==' compara apenas valores"
  },
  {
    "pergunta": "O que é o evento 'DOMContentLoaded' em JavaScript?",
    "respostas": [
      "Um evento que é acionado quando um elemento HTML é clicado",
      "Um evento que é acionado quando uma página web é completamente carregada",
      "Um evento que é acionado quando um formulário é enviado",
      "Um evento que é acionado quando um formulário é enviado"
    ],
    "resposta_correta": "Um evento que é acionado quando o DOM da página é completamente carregado"
  },
  {
    "pergunta": "O que é um endereço IP?",
    "respostas": [
      "Um endereço físico que identifica um computador em uma rede",
      "Um endereço lógico que identifica um computador em uma rede",
      "Um endereço de e-mail utilizado para enviar mensagens para outros computadores em uma rede",
      "Um endereço de localização de arquivos armazenados em um servidor"
    ],
    "resposta_correta": "Um endereço lógico que identifica um computador em uma rede"
  },
  {
    "pergunta": "O que é um protocolo de rede?",
    "respostas": [
      "Um conjunto de regras e padrões que governam a comunicação entre dispositivos em uma rede",
      "Um tipo de cabo utilizado para conectar dois dispositivos em uma rede",
      "Um software que permite compartilhar arquivos entre dispositivos em uma rede",
      "Um dispositivo que amplifica o sinal de rede em áreas com pouca cobertura"
    ],
    "resposta_correta": "Um conjunto de regras e padrões que governam a comunicação entre dispositivos em uma rede"
  },
  {
    "pergunta": "O que é o DNS?",
    "respostas": [
      "Um protocolo utilizado para transferir arquivos entre dispositivos em uma rede",
      "Um serviço que permite acessar sites da internet por meio de nomes de domínio em vez de endereços IP",
      "Um tipo de firewall que bloqueia o acesso a sites perigosos na internet",
      "Um tipo de criptografia utilizada para proteger a privacidade das comunicações em uma rede"
    ],
    "resposta_correta": "Um serviço que permite acessar sites da internet por meio de nomes de domínio em vez de endereços IP"
  },
  {
    "pergunta": "Qual é a linguagem de programação utilizada para desenvolver o kernel do sistema operacional Linux?",
    "respostas": [
      "C++",
      "Python",
      "Java",
      "C"
    ],
    "resposta_correta": "C"
  },
  {
    "pergunta": "Quais são as possíveis medidas a serem tomadas caso um computador trave?",
    "respostas": [
      "Pressionar simultaneamente as teclas Ctrl + Alt + Del para abrir o Gerenciador de Tarefas e encerrar os processos em execução",
      "Pressionar o botão de reset para reiniciar o computador",
      "Desligar o computador diretamente da fonte de energia",
      "Corre que é demonio"
    ],
    "resposta_correta": "Pressionar simultaneamente as teclas Ctrl + Alt + Del para abrir o Gerenciador de Tarefas e encerrar os processos em execução"
  }
]
